results/ycsb/4-nodes/6-clients/couchbase2/workloada_couchbase_custom-validation/results-100.txt
[OVERALL], RunTime(ms), 44665
[OVERALL], Throughput(ops/sec), 2238.889510802642
[TOTAL_GCS_G1_Young_Generation], Count, 21
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 610
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.3657226015896116
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 21
[TOTAL_GC_TIME], Time(ms), 610
[TOTAL_GC_TIME_%], Time(%), 1.3657226015896116
[READ], Operations, 50327
[READ], AverageLatency(us), 34582.07858604725
[READ], MinLatency(us), 69
[READ], MaxLatency(us), 3584245
[READ], Return=OK, 50327
[READ], 0, 161708.78736208627
[READ], 1000, 36267.057243816256
[READ], 2000, 39689.100676818955
[READ], 3000, 35412.04362880887
[READ], 4000, 45158.13051305131
[READ], 5000, 37243.14690909091
[READ], 6000, 36102.59101844427
[READ], 7000, 41880.01430615164
[READ], 8000, 42100.3650533224
[READ], 9000, 34675.78526754691
[READ], 10000, 43026.7406779661
[READ], 11000, 33389.160220994476
[READ], 12000, 46465.711487088156
[READ], 13000, 40315.3515687852
[READ], 14000, 42481.60106856634
[READ], 15000, 29441.89222222222
[READ], 16000, 38880.88582089552
[READ], 17000, 38729.437860082304
[READ], 18000, 47913.74948875255
[READ], 19000, 32910.57785016287
[READ], 20000, 30938.63087248322
[READ], 21000, 31823.18595279217
[READ], 22000, 24654.432902584493
[READ], 23000, 28564.954490291264
[READ], 24000, 29551.446247464504
[READ], 25000, 30650.558732612055
[READ], 26000, 18260.114369501465
[READ], 27000, 38386.04866666667
[READ], 28000, 28382.797728885733
[READ], 29000, 22588.00412735849
[READ], 30000, 24036.946969696968
[READ], 31000, 22688.164948453606
[READ], 32000, 30469.91412742382
[READ], 33000, 24445.038800705468
[READ], 34000, 16444.441590720795
[READ], 35000, 14315.191377497371
[READ], 36000, 11887.809711286089
[READ], 37000, 6084.032520325203
[CLEANUP], Operations, 100
[CLEANUP], AverageLatency(us), 0.69
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 14
[CLEANUP], 0, 14.0
[CLEANUP], 2000, 2.5
[CLEANUP], 4000, 0.6666666666666666
[CLEANUP], 5000, 0.42857142857142855
[CLEANUP], 6000, 1.0
[CLEANUP], 7000, 0.5
[CLEANUP], 8000, 0.6666666666666666
[CLEANUP], 10000, 1.0
[CLEANUP], 11000, 1.0
[CLEANUP], 12000, 0.4444444444444444
[CLEANUP], 13000, 1.0
[CLEANUP], 14000, 0.3333333333333333
[CLEANUP], 15000, 0.3076923076923077
[CLEANUP], 16000, 0.1111111111111111
[CLEANUP], 17000, 1.0833333333333333
[CLEANUP], 18000, 0.3076923076923077
[CLEANUP], 19000, 0.0
[UPDATE], Operations, 49672
[UPDATE], AverageLatency(us), 34997.01197857948
[UPDATE], MinLatency(us), 112
[UPDATE], MaxLatency(us), 3304549
[UPDATE], Return=OK, 49673
[UPDATE], 0, 167201.7574879227
[UPDATE], 1000, 35719.22340425532
[UPDATE], 2000, 43613.60199004975
[UPDATE], 3000, 36066.910602910604
[UPDATE], 4000, 47689.11872586873
[UPDATE], 5000, 37641.62174236783
[UPDATE], 6000, 33219.95435684647
[UPDATE], 7000, 39674.7645003494
[UPDATE], 8000, 40066.36558219178
[UPDATE], 9000, 34264.191229331416
[UPDATE], 10000, 44390.27318718381
[UPDATE], 11000, 37251.791666666664
[UPDATE], 12000, 42439.95711500975
[UPDATE], 13000, 44109.01320132013
[UPDATE], 14000, 41318.11531841652
[UPDATE], 15000, 28623.310483870966
[UPDATE], 16000, 37692.16939890711
[UPDATE], 17000, 38423.481712062254
[UPDATE], 18000, 51319.64313346228
[UPDATE], 19000, 34250.18793650794
[UPDATE], 20000, 32355.75067204301
[UPDATE], 21000, 28540.230527638192
[UPDATE], 22000, 25633.51902587519
[UPDATE], 23000, 28401.847332924586
[UPDATE], 24000, 28267.387978142076
[UPDATE], 25000, 30045.603938730852
[UPDATE], 26000, 19785.72634920635
[UPDATE], 27000, 36299.64091559371
[UPDATE], 28000, 31244.687679083094
[UPDATE], 29000, 24213.451327433628
[UPDATE], 30000, 23223.14074984634
[UPDATE], 31000, 23038.88458781362
[UPDATE], 32000, 29128.312159709618
[UPDATE], 33000, 23482.641560798547
[UPDATE], 34000, 16793.35845749343
[UPDATE], 35000, 15085.391440501044
[UPDATE], 36000, 13296.268844221106
[UPDATE], 37000, 6815.200514138817