results/ycsb/4-nodes/6-clients/couchbase2/workloada_couchbase_custom-validation/results-30.txt
[OVERALL], RunTime(ms), 57105
[OVERALL], Throughput(ops/sec), 1751.1601435951318
[TOTAL_GCS_G1_Young_Generation], Count, 15
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 377
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.6601873741353648
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 15
[TOTAL_GC_TIME], Time(ms), 377
[TOTAL_GC_TIME_%], Time(%), 0.6601873741353648
[READ], Operations, 49931
[READ], AverageLatency(us), 12772.670024633995
[READ], MinLatency(us), 75
[READ], MaxLatency(us), 4202970
[READ], Return=OK, 49931
[READ], 0, 32443.272459499265
[READ], 1000, 19534.753086419754
[READ], 2000, 14452.210416666667
[READ], 3000, 15551.304730473048
[READ], 4000, 15671.989631336406
[READ], 5000, 13794.57142857143
[READ], 6000, 15597.484662576688
[READ], 7000, 12660.941993464052
[READ], 8000, 14559.496078431372
[READ], 9000, 21527.311557788944
[READ], 10000, 17885.735645933015
[READ], 11000, 12117.755996691481
[READ], 12000, 11852.893680297399
[READ], 13000, 11329.045597484277
[READ], 14000, 9684.629658385093
[READ], 15000, 11233.166541070083
[READ], 16000, 9580.637331440737
[READ], 17000, 14896.960725075529
[READ], 18000, 12871.51143641354
[READ], 19000, 18241.793193717276
[READ], 20000, 11758.034452296819
[READ], 21000, 12988.686496694996
[READ], 22000, 13607.111641221374
[READ], 23000, 14688.931593159316
[READ], 24000, 13512.219982471515
[READ], 25000, 11887.265584970111
[READ], 26000, 15599.382675438597
[READ], 27000, 13196.672354948805
[READ], 28000, 11878.115257048094
[READ], 29000, 14596.337271750806
[READ], 30000, 13181.25179856115
[READ], 31000, 11462.264633140972
[READ], 32000, 12066.705009276438
[READ], 33000, 13336.656455142233
[READ], 34000, 13736.498908296944
[READ], 35000, 14200.581736189402
[READ], 36000, 11544.87213740458
[READ], 37000, 9827.272954924874
[READ], 38000, 12368.18775510204
[READ], 39000, 12044.187898089172
[READ], 40000, 7712.490016638935
[READ], 41000, 8397.96251018745
[READ], 42000, 7767.357597816196
[READ], 43000, 6499.74299634592
[READ], 44000, 2452.112224448898
[READ], 45000, 2222.5069124423962
[READ], 47000, 51878.04240282685
[READ], 48000, 9288.994371482177
[READ], 49000, 7700.176146788991
[READ], 50000, 5205.421875
[READ], 51000, 4953.15565031983
[READ], 52000, 4403.425770308123
[READ], 53000, 3659.616
[CLEANUP], Operations, 30
[CLEANUP], AverageLatency(us), 1.5
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 18
[CLEANUP], 0, 1.0
[CLEANUP], 3000, 1.0
[CLEANUP], 4000, 1.0
[CLEANUP], 7000, 0.5
[CLEANUP], 9000, 0.0
[CLEANUP], 11000, 1.0
[CLEANUP], 12000, 1.5
[CLEANUP], 13000, 1.0
[CLEANUP], 14000, 1.0
[CLEANUP], 15000, 0.6666666666666666
[CLEANUP], 16000, 1.0
[CLEANUP], 20000, 18.0
[CLEANUP], 21000, 1.0
[CLEANUP], 22000, 0.5
[CLEANUP], 23000, 1.0
[CLEANUP], 24000, 1.3333333333333333
[UPDATE], Operations, 50069
[UPDATE], AverageLatency(us), 13813.15270926122
[UPDATE], MinLatency(us), 117
[UPDATE], MaxLatency(us), 4209241
[UPDATE], Return=OK, 50069
[UPDATE], 0, 34740.92205882353
[UPDATE], 1000, 24971.098378378378
[UPDATE], 2000, 15259.129201680673
[UPDATE], 3000, 18159.988396624474
[UPDATE], 4000, 17362.68023255814
[UPDATE], 5000, 15299.992292870906
[UPDATE], 6000, 15644.457572502686
[UPDATE], 7000, 12511.240432612312
[UPDATE], 8000, 14942.342741935483
[UPDATE], 9000, 16367.123036649215
[UPDATE], 10000, 18035.65974625144
[UPDATE], 11000, 11645.443932411674
[UPDATE], 12000, 11484.70102281668
[UPDATE], 13000, 11588.482534524777
[UPDATE], 14000, 13195.969953775038
[UPDATE], 15000, 12531.192626034612
[UPDATE], 16000, 11270.516725978649
[UPDATE], 17000, 14196.635005336178
[UPDATE], 18000, 16165.449777777778
[UPDATE], 19000, 20045.4725
[UPDATE], 20000, 14036.78391959799
[UPDATE], 21000, 14856.493554327808
[UPDATE], 22000, 14546.061895551256
[UPDATE], 23000, 11966.632911392406
[UPDATE], 24000, 13813.727836879432
[UPDATE], 25000, 13662.13787085515
[UPDATE], 26000, 15352.974830590512
[UPDATE], 27000, 13079.234982332155
[UPDATE], 28000, 13345.80276816609
[UPDATE], 29000, 16998.272828507794
[UPDATE], 30000, 15114.324351297406
[UPDATE], 31000, 13348.535269709544
[UPDATE], 32000, 13528.543497757848
[UPDATE], 33000, 14253.412190082645
[UPDATE], 34000, 14455.783505154639
[UPDATE], 35000, 14065.82974137931
[UPDATE], 36000, 12849.001953125
[UPDATE], 37000, 10297.622564935065
[UPDATE], 38000, 11436.153608247423
[UPDATE], 39000, 12753.327956989247
[UPDATE], 40000, 8183.868032786885
[UPDATE], 41000, 8711.694048616931
[UPDATE], 42000, 7840.353526220615
[UPDATE], 43000, 6367.566489361702
[UPDATE], 44000, 2905.4128256513027
[UPDATE], 45000, 2284.4653465346537
[UPDATE], 47000, 89118.89152542372
[UPDATE], 48000, 7904.4
[UPDATE], 49000, 7809.333333333333
[UPDATE], 50000, 6228.0658499234305
[UPDATE], 51000, 5459.539033457249
[UPDATE], 52000, 4104.794871794872
[UPDATE], 53000, 3858.6260162601625