results/ycsb/4-nodes/6-clients/couchbase2/workloada_couchbase_custom-validation/results-50.txt
[OVERALL], RunTime(ms), 50150
[OVERALL], Throughput(ops/sec), 1994.0179461615155
[TOTAL_GCS_G1_Young_Generation], Count, 20
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 451
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.8993020937188435
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 20
[TOTAL_GC_TIME], Time(ms), 451
[TOTAL_GC_TIME_%], Time(%), 0.8993020937188435
[READ], Operations, 50138
[READ], AverageLatency(us), 18681.925605329292
[READ], MinLatency(us), 86
[READ], MaxLatency(us), 2603924
[READ], Return=OK, 50138
[READ], 0, 114025.36880733944
[READ], 1000, 24674.833003952568
[READ], 2000, 19863.561834561835
[READ], 3000, 19520.786415711947
[READ], 4000, 21562.02491103203
[READ], 5000, 23313.80867106503
[READ], 6000, 19625.368338557993
[READ], 7000, 22680.116894197952
[READ], 8000, 16629.284201235656
[READ], 9000, 22343.90007570023
[READ], 10000, 19580.14937759336
[READ], 11000, 12118.03795180723
[READ], 12000, 13050.617586912065
[READ], 13000, 33077.9929022082
[READ], 14000, 20617.036585365855
[READ], 15000, 18281.69211409396
[READ], 16000, 19872.807324840764
[READ], 17000, 16320.36131147541
[READ], 18000, 16563.638466622604
[READ], 19000, 16529.16825613079
[READ], 20000, 16545.124833997343
[READ], 21000, 17174.408163265307
[READ], 22000, 16005.04583602324
[READ], 23000, 13990.42400482509
[READ], 24000, 15698.646
[READ], 25000, 18562.81488372093
[READ], 26000, 19729.662119622244
[READ], 27000, 23880.968013468013
[READ], 28000, 17528.701771653545
[READ], 29000, 22590.279046673288
[READ], 30000, 15683.363965267728
[READ], 31000, 17463.181897302
[READ], 32000, 17247.48306010929
[READ], 33000, 14794.755256518083
[READ], 34000, 15410.181902985074
[READ], 35000, 14090.991565135895
[READ], 36000, 16329.974501108647
[READ], 37000, 17249.10644257703
[READ], 38000, 14635.422626788037
[READ], 39000, 12768.173852573018
[READ], 40000, 12410.207142857143
[READ], 41000, 6819.555974842768
[READ], 42000, 9528.705747126436
[READ], 43000, 3385.855871886121
[READ], 44000, 2075.877358490566
[CLEANUP], Operations, 50
[CLEANUP], AverageLatency(us), 1.08
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 4
[CLEANUP], 0, 1.0
[CLEANUP], 1000, 1.0
[CLEANUP], 2000, 0.5
[CLEANUP], 3000, 1.0
[CLEANUP], 4000, 3.0
[CLEANUP], 6000, 1.0
[CLEANUP], 8000, 1.5
[CLEANUP], 9000, 1.0
[CLEANUP], 10000, 1.5
[CLEANUP], 11000, 1.0
[CLEANUP], 12000, 1.0
[CLEANUP], 13000, 1.0
[CLEANUP], 14000, 1.0
[CLEANUP], 15000, 1.0
[CLEANUP], 16000, 1.0
[CLEANUP], 17000, 1.25
[CLEANUP], 18000, 1.0
[CLEANUP], 19000, 1.0
[CLEANUP], 20000, 1.0
[CLEANUP], 21000, 0.5
[CLEANUP], 22000, 1.0
[UPDATE], Operations, 49862
[UPDATE], AverageLatency(us), 19104.29834342786
[UPDATE], MinLatency(us), 110
[UPDATE], MaxLatency(us), 2617291
[UPDATE], Return=OK, 49862
[UPDATE], 0, 89098.60305343512
[UPDATE], 1000, 24355.042635658916
[UPDATE], 2000, 22020.097440132122
[UPDATE], 3000, 20145.966801619434
[UPDATE], 4000, 21529.928938356163
[UPDATE], 5000, 23736.814882032668
[UPDATE], 6000, 20183.823232323233
[UPDATE], 7000, 21073.80315614618
[UPDATE], 8000, 24162.12285456188
[UPDATE], 9000, 19553.173343605547
[UPDATE], 10000, 17764.663980660756
[UPDATE], 11000, 11906.737321196359
[UPDATE], 12000, 16144.545207341944
[UPDATE], 13000, 25464.038111019054
[UPDATE], 14000, 21809.853377265237
[UPDATE], 15000, 20768.875975039
[UPDATE], 16000, 20907.73775671406
[UPDATE], 17000, 16774.98862115127
[UPDATE], 18000, 17631.595804195804
[UPDATE], 19000, 17114.650847457626
[UPDATE], 20000, 16708.92972972973
[UPDATE], 21000, 17830.40564738292
[UPDATE], 22000, 15614.58026233604
[UPDATE], 23000, 14748.172817809022
[UPDATE], 24000, 16164.717391304348
[UPDATE], 25000, 19689.76802507837
[UPDATE], 26000, 16007.701932858596
[UPDATE], 27000, 24476.451827242527
[UPDATE], 28000, 20801.937785910337
[UPDATE], 29000, 20008.55885363357
[UPDATE], 30000, 15950.095488721805
[UPDATE], 31000, 18207.08897485493
[UPDATE], 32000, 20843.065662002155
[UPDATE], 33000, 15906.287852112677
[UPDATE], 34000, 17804.117270788913
[UPDATE], 35000, 15455.266114180478
[UPDATE], 36000, 15771.482197355035
[UPDATE], 37000, 20931.920967741935
[UPDATE], 38000, 17288.006605019815
[UPDATE], 39000, 12075.941605839416
[UPDATE], 40000, 11876.453125
[UPDATE], 41000, 8042.71543624161
[UPDATE], 42000, 8745.030651340996
[UPDATE], 43000, 3117.7295454545456
[UPDATE], 44000, 16094.5